app/controllers/pins_controller.rb

INSERT INTO "pins" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 09 Jan 2016 09:17:37 UTC +00:00], ["description", "sample one"], ["updated_at", Sat, 09 Jan 2016 09:17:37 UTC +00:00]]
---
  def create
    @pin = Pin.new(pin_params)
    if @pin.save